# 03. 통계(with타이타닉호 데이터)
* https://wikidocs.net/136226

In [2]:
# 모듈 다운
from IPython.display import Image
import numpy as np
import pandas as pd
import seaborn as sns
import warnings

warnings.filterwarnings('ignore')

In [3]:
# 데이터 셋 다운
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## describe() - 요약통계
* 전반적인 주요 통계를 확인할 수 있습니다.
* 기본 값으로 수치형(Numerical) 컬럼에 대한 통계표를 보여줍니다.

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [5]:
# object만 출력
df.describe(include='object')

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

## count() - 개수
* 데이터의 개수
* DataFrame 전체의 개수를 구하는 경우

In [7]:
df.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [8]:
# 단일열 카운트
df['age'].count()

714

## mean() - 평균
* 데이터의 평균
* DataFrame 평균

In [9]:
df.mean()

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [10]:
# 단일 평균
df['age'].mean()

29.69911764705882

In [14]:
# 조건별 평균
cond = (df['adult_male'] == True)
df.loc[cond,'age'].mean()

33.17312348668281

In [15]:
# skipna - False, NaN 값이 있는 column은 NaN 값으로 출력 됩니다.
df.mean(skipna=False)

survived       0.383838
pclass         2.308642
age                 NaN
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

## median() - 중앙값
* 데이터의 중앙 값을 출력 합니다. 데이터를 오름차순 정렬하여 중앙에 위치한 값입니다.
* 이상치(outlier)가 존재하는 경우, mean()보다 median()을 대표값으로 더 선호합니다.
* <b>짝수개의 데이터가 있는 경우에는 운데 2개 중앙 데이터의 평균 값을 출력 합니다. </br>

In [16]:
pd.Series([1, 2, 3, 4, 5]).median()

3.0

In [17]:
pd.Series([1, 2, 3, 4, 5, 6]).median()

3.5

## sum() - 합계
* 데이터의 합계입니다. 문자열 column은 모든 데이터가 붙어서 출력될 수 있습니다.

In [18]:
df.loc[:, ['age', 'fare']].sum()

age     21205.1700
fare    28693.9493
dtype: float64

In [19]:
df['fare'].sum()

28693.9493

## cumsum() - 누적합, cumprod() - 누적곱

In [22]:
df['age'].cumsum()

0         22.00
1         60.00
2         86.00
3        121.00
4        156.00
         ...
886    21128.17
887    21147.17
888         NaN
889    21173.17
890    21205.17
Name: age, Length: 891, dtype: float64

In [24]:
#  너무 값이 커서 잘 사용 안함
df['age'].cumprod()

0            22.0
1           836.0
2         21736.0
3        760760.0
4      26626600.0
          ...
886           inf
887           inf
888           NaN
889           inf
890           inf
Name: age, Length: 891, dtype: float64

## var() - 분산

In [25]:
df['fare'].var()

2469.436845743117

## std() - 표준편차

In [30]:
np.sqrt(df['fare'].var())

49.693428597180905

In [27]:
df['fare'].std()

49.693428597180905

## min() - 최소값, max() - 최대값

In [31]:
df['age'].min()

0.42

In [32]:
df['age'].max()

80.0

## agg - aggregation: 통합 통계 적용 (복수의 통계 함수 적용)

In [35]:
# 단일 컬럼 적용
df['age'].agg(['min', 'max', 'count', 'mean'])

min        0.420000
max       80.000000
count    714.000000
mean      29.699118
Name: age, dtype: float64

In [36]:
# 복수 컬럼 적용
df[['age', 'fare']].agg(['min', 'max', 'count', 'mean'])

              age        fare
min      0.420000    0.000000
max     80.000000  512.329200
count  714.000000  891.000000
mean    29.699118   32.204208

## quantile() - 분위
* quantile이란 주어진 데이터를 동등한 크기로 분할하는 지점을 말합니다

In [39]:
# 10% 지점
df['age'].quantile(0.1)

14.0

In [40]:
# 80% 지점
df['age'].quantile(0.8)

41.0

## unique() - 고유값, nunique() - 고유값 개수
* 고유값과 고유값의 개수를 구하고자 할 때 사용합니다.

In [43]:
df['who'].unique()

array(['man', 'woman', 'child'], dtype=object)

In [44]:
df['who'].nunique()

3

## mode() - 최빈값
* 최빈값은 가장 많이 출현한 데이터를 의미합니다.

In [46]:
df['who'].mode()

0    man
Name: who, dtype: object

In [48]:
# 카테고리 타입도 가능
df['deck'].mode()

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

## corr() - 상관관계
* corr()로 컬럼(column)별 상관관계를 확인할 수 있습니다.
* -1~1 사이의 범위를 가집니다.
* -1에 가까울 수록 반비례 관계, 1에 가까울수록 정비례 관계를 의미합니다.

In [49]:
df.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [50]:
# 특정 컬럼에 대한 상관관계
df.corr()['survived']

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64

# 연습문제

## 1번 문제
* 다음 조건을 만족하는 승객의 나이 평균과 조건을 만족하는 데이터의 개수를 구하세요.
* fare를 30 이상 40 미만 지불한 승객
* pclass는 1등급

In [57]:
cond1 = (df['fare'] >=30) & (df['fare'] < 40)
cond2 = (df['pclass'] == 1)
print(df.loc[(cond1 & cond2),'age'].mean()) # 평균
print(df.loc[(cond1 & cond2),'age'].count())# 개수

44.095238095238095
21

## 2번문제

In [60]:
diamond = sns.load_dataset('diamonds')
diamond.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

### depth의 최소값을 구하세요

In [61]:
diamond['depth'].min()

43.0

### carat에 대한 평균과 분산을 동시에 출력하세요

In [89]:
diamond['carat'].agg(['mean','var'])

mean    0.797940
var     0.224687
Name: carat, dtype: float64

### x, y에 대한 합계와 표준편차를 출력하세요

In [93]:
diamond[['x','y']].agg(['sum','std'])

                 x              y
sum  309138.620000  309320.330000
std       1.121761       1.142135

## 3번문제

In [94]:
penguin = sns.load_dataset('penguins')
penguin

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

### species 컬럼의 고유값을 출력해 주세요

In [95]:
penguin['species'].unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

### island 컬럼의 최빈값을 출력해 주세요

In [96]:
penguin['island'].mode()

0    Biscoe
Name: island, dtype: object

### body_mass_g 컬럼의 10% 분위수 값(하위 10%)을 출력해 주세요

In [98]:
penguin['body_mass_g'].quantile(0.1)

3300.0

### body_mass_g 컬럼의 80% 분위수 값(상위 20%)을 출력해 주세요

In [99]:
penguin['body_mass_g'].quantile(0.8)

4950.0